## 编写的第一个点名程序

import random
n = int(input("请输入："))
name={2019660101:'周嘉铖',2019660102:'钱珑超',2019660103:'徐展',2019660104:
    '尤桉哲',2019660105:'钱涛',2019660106:'黄舒怡',2019660107:'胡志辉',2019660108:'吴昭耀',
    201966019:'陈萌萌',201966010:'郑巧悦',2019660111:'陈艳',2019660112:'梁明皓',2019660113:'蒋俊超',
    2019660114:'徐颖',2019660115:'倪宏涛',20196650116:'潘梦倩',2019660117:'王中阳',2019660118
    :'毛贞强',2019660119:'张嫒',2019660120:'朱速航',2019660121:'陈涛'
    ,2019660122:'陆元超',2019660123:'叶振雄',2019660124:'奚申杰',
    2019660125:'叶梦婷',2019660126:'徐丽丽',2019660127:'潘艳'} ## 创建一个班级信息字典，key为学号，value为姓名。
do = random.sample(name.keys(),n)# 从name中随机获取n个元素，作为一个片段返回
for i in do:
    print(i,name[i])## name[i] 中的[i] 是什么意思呢
##i 是遍历do中的每一个元素，打印i是学号，name[i]是从字典中对应的名字。